## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

- Successfuly installed: 최초 설치
- Requirement already satisfied: 이미 설치되어 있는 상태

In [23]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### Pandas 라이브러리 로딩
```python
import pandas as pd
```

In [24]:
import pandas as pd

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row): 각 하나의 유니크한 데이터 묶음
- 열(column): 유니크 데이터 하나하나의 특성

In [25]:
# 딕셔너리로 DataFrame 객체 생성 = 2차원 리스트와 동일하게 생성 가능
data = {'이름': ['홍길동', '김길동', '애슐리'], '나이': [25, 20, 40], '결혼 여부': [False, True, True]}
df = pd.DataFrame(data=data)
df

    이름  나이  결혼 여부
0  홍길동  25  False
1  김길동  20   True
2  애슐리  40   True

In [26]:
data = [['홍길동' , 25, '율도국', 'email@naver.com', False], ['김길동', 20, '부산', 'kimail@naver.com', True]
        , ['애슐리', 40, '경기', 'ashley@nate.com', True], ['홍길순', 19, '서울', 'hgs@gamil.com', False]]

data

[['홍길동', 25, '율도국', 'email@naver.com', False],
 ['김길동', 20, '부산', 'kimail@naver.com', True],
 ['애슐리', 40, '경기', 'ashley@nate.com', True],
 ['홍길순', 19, '서울', 'hgs@gamil.com', False]]

In [27]:
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소','이메일', '결혼 여부'])
df

    이름  나이   주소               이메일  결혼 여부
0  홍길동  25  율도국   email@naver.com  False
1  김길동  20   부산  kimail@naver.com   True
2  애슐리  40   경기   ashley@nate.com   True
3  홍길순  19   서울     hgs@gamil.com  False

In [30]:
#DataFrame에서 데이터 조회(열 조회) - 리스트는  for문 써야 출력 가능
df['이름']

0    홍길동
1    김길동
2    애슐리
3    홍길순
Name: 이름, dtype: object

In [34]:
#DataFrame 조회(2개 열 조회)
df[['이름', '나이']]

    이름  나이
0  홍길동  25
1  김길동  20
2  애슐리  40
3  홍길순  19

In [37]:
#데이터프레임 행으로 조회(결과 세로로 나옴)
df.loc[0]

이름                   홍길동
나이                    25
주소                   율도국
이메일      email@naver.com
결혼 여부              False
Name: 0, dtype: object

In [41]:
#데이터프레임 조회(행)
df.loc[[0, 1]]

    이름  나이   주소               이메일  결혼 여부
0  홍길동  25  율도국   email@naver.com  False
1  김길동  20   부산  kimail@naver.com   True

In [44]:
#현재 데이터프레임 확인
df

    이름  나이   주소               이메일  결혼 여부
0  홍길동  25  율도국   email@naver.com  False
1  김길동  20   부산  kimail@naver.com   True
2  애슐리  40   경기   ashley@nate.com   True
3  홍길순  19   서울     hgs@gamil.com  False

In [49]:
#새 컬럼 추가(제일 마지막 열에 추가됨)
df['전화번호'] = ['010', '011', '017', '019']

In [50]:
#추가된 데이터프레임 확인
df

    이름  나이   주소               이메일  결혼 여부 전화번호
0  홍길동  25  율도국   email@naver.com  False  010
1  김길동  20   부산  kimail@naver.com   True  011
2  애슐리  40   경기   ashley@nate.com   True  017
3  홍길순  19   서울     hgs@gamil.com  False  019

In [51]:
#열 삭제, axis=0(행)-생략 가능 / axis=1(열)
df.drop('결혼 여부', axis=1)

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019

In [53]:
df

    이름  나이   주소               이메일  결혼 여부 전화번호
0  홍길동  25  율도국   email@naver.com  False  010
1  김길동  20   부산  kimail@naver.com   True  011
2  애슐리  40   경기   ashley@nate.com   True  017
3  홍길순  19   서울     hgs@gamil.com  False  019

In [57]:
#drop(): 삭제 상태 출력만 함(저장 X), 완전 삭제 위해서는 inplace 옵션 사용
df.drop('결혼 여부', axis=1, inplace=True)  #inplace 사용 시 출력 안됨
#지운 뒤에 재실행 시 오류 뜸(∵df에 결혼 여부 없음)

KeyError: "['결혼 여부'] not found in axis"

In [58]:
#삭제 확인
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019

In [68]:
#행 추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gamil.com', '020']

In [69]:
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

In [72]:
#행 삭제, 완전 삭제를 원하면 inplace 사용 혹은 변수에 재할당
df2 = df.drop(3)

In [74]:
df2

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
4  손흥민  32   런던     shm@gamil.com  020

In [75]:
#행 삭제(inplace 사용)
df.drop(2, axis=0, inplace=True)

In [77]:
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

In [82]:
#열 이름 변경
df.rename(columns={'전화번호':'휴대폰'})    #변경 내용 출력만 함
df.rename(columns={'전화번호':'휴대폰'}, inplace=True)  #변경 후 저장(출력 안함)

In [83]:
df

    이름  나이   주소               이메일  휴대폰
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하나, 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

-